#!/bin/bash
# Встановлюємо формат файлів для пошуку.
if [ $# -ne 1 ]; then
    echo "Будь ласка, вкажіть формат файлів, які ми шукаємо та переміщуємо."
    exit 1
fi

# Зберігаємо введений формат файлів у змінну.
format=$1

# Змінюємо робочу директорію на /tmp.
cd /tmp

# Створюємо нову папку /tmp/newdir
mkdir -p newdir

# Копіюємо файли з вказаним форматом у нову папку.
# Використовуємо *.$format для вибору файлів з вказаним розширенням.
# || вказує на виконання наступної команди в разі помилки копіювання файлів.
cp *.$format /tmp/newdir || { echo "Файли не було скопійовано в /tmp/newdir"; exit 1; }

# Виводимо повідомлення про успішне завершення копіювання файлів.
echo "Файли з форматом $format були успішно скопійовані в /tmp/newdir"
